* LPC2488 FT FLOW
** TODO [#A] complete flow and testmethod
DEADLINE: <2016-03-07 Mon> SCHEDULED: <2016-03-04 Fri>

*** DONE [#A] review wt flow 
CLOSED: [2016-03-01 Tue 09:33]
:LOGBOOK:
CLOCK: [2016-02-29 Mon 13:10]--[2016-02-29 Mon 16:47] =>  3:37
:END:


- func_test()  PASS = 0X50 FAIL = 0X46
- StandardRun()  PASS = 0  FAIL = 1
**** TODO [#A] *need insert Assign node sramloader100pin before PLL_Max_Freq Test*
#+BEGIN_SRC c -n 
      else
      { 



sramloader100pin = 0; 
// *********************************************************************************
// * ************************ KFLASH_Misr_Blank test *******************************
// *********************************************************************************


// Float vddcore3 supply to allow vdd1.8 pin to pull core voltage down using only ~10mA.
// If you do not float vddcore3 supply then cannot pull core voltage down without using 
// destructive >200mA.
// Blank check should be done at 1.6V based on previous parts wafersort pass2 blank check.
// This test required Vbat to be set to 1.6V to allow blank check to pass down to 1.1V. 



     
     if (functional_tests_fcc1_mincorevdd18 ("kf_misr_blank", 
                                 allpins, 
                                 1.6 V, 3.0 V, // 
                                 1.0, 
                                 0.0 V, 3.0 V, 
                                 0.8 V, 1.5 V, 
                                LABEL_START(kf_misr),    // start
                                LABEL_START(kf_misr_r2), // stop1
                                LABEL_STOP(kf_misr),     // stop2
                                blank_bin)) return 1;
    

if (test_time)  DELTA_TIME("=========== KFLASH blank check ============"); 

      }


sramloader100pin = 0;
// *********************************************************************************
// **************************** PLL_Max_Freq Test  *********************************
// *********************************************************************************

#+END_SRC
**** TODO [#A] *static int flag_match[TOTAL_SITE] every element initialize to zero* 
#+BEGIN_SRC c -n j
int site_match_num=0;
		int enable_site_num = GET_ENABLED_SITES(site);
		FOR_EACH_SITE_BEGIN();
			flag_match[CURRENT_SITE] = 0;
		FOR_EACH_SITE_END();

		INT offline;
		GET_SYSTEM_FLAG("offline", &offline);
		if (info)
		{
			if(dierev1){temp = 8.0;}
			else{temp = 12.0;}
			for (j=temp; j<60.0; j = j + 0.03)//todo test time need consideration with precision step
			{
				if(site_match_num==enable_site_num)//ALL Enabled Sites Matched
				{
				   break;//j = 60.0;
				}
        
				Primary.getTimingSpec().change("freq", j);
				FLUSH(TM::APRM);

				Primary.label(pattern);
				FUNCTIONAL_TEST();
				FOR_EACH_SITE_BEGIN();
					if(flag_match[CURRENT_SITE]==0)  // ********** is this necessary?
				    {
						PF[CURRENT_SITE][1] = GET_FUNCTIONAL_RESULT();
						if(offline)
						{
							if(PF[CURRENT_SITE][1]==1)
							{
								site_match_num=site_match_num + 1;
								flag_match[CURRENT_SITE]=1;
								match_val[CURRENT_SITE]=j;
								if(debug) cout <<"PllMeasMaxFreq="<<j * 32<< " at DCDC-100mA ext load, PllPassFreqlimit=>"<<FreqMhz<<"Mhz"<< endl;
							}
						}
						else
						{
							if(PF[CURRENT_SITE][1]==0)
							{
								site_match_num=site_match_num + 1;
								flag_match[CURRENT_SITE]=1;
								match_val[CURRENT_SITE]=j;
								if(debug) cout <<"PllMeasMaxFreq="<<j * 32<< " at DCDC-100mA ext load, PllPassFreqlimit=>"<<FreqMhz <<"Mhz"<< endl;
							}
						}
				    }
#+END_SRC
**** TODO [#A] *remove startup due to TTR*
**** ficm write example 
downloadUserVectorRange: 290 and 205 is the length

#+BEGIN_SRC c
//		ficm_write(pattern,"PIN0_17",pulse_1st_h_vector-200,pulse_1st_h_vector+90,"L");// make sure pattern pulse has L data
//		ficm_write(pattern,"PIN0_17",pulse_1st_h_vector + vec_adjust,pulse_1st_h_vector+200,"X"); // set all vectors after pulse transition + 20 with X data for trim search routine
		VEC_LABEL_EDIT labelp017(pattern,"PIN0_17");
		labelp017.storeVectorData(pulse_1st_h_vector-200, 400);
		labelp017.downloadUserVectorRange(pulse_1st_h_vector-200,290,phyWaveIdex_L);
		labelp017.downloadUserVectorRange(pulse_1st_h_vector + vec_adjust,205,phyWaveIdex_X);

#+END_SRC
*** DONE [#A] modify ft flow
CLOSED: [2016-03-28 Mon 14:57]

:LOGBOOK:
CLOCK: [2016-03-03 Thu 14:07]--[2016-03-03 Thu 16:09] =>  2:02
CLOCK: [2016-03-03 Thu 08:57]--[2016-03-03 Thu 11:08] =>  2:11
CLOCK: [2016-03-01 Tue 13:08]--[2016-03-01 Tue 15:32] =>  2:24
CLOCK: [2016-03-01 Tue 09:35]--[2016-03-01 Tue 11:18] =>  1:43


:END:


**** DONE Init: add global variables at code
CLOSED: [2016-03-02 Wed 13:59]
add one c file and testmethod
**** DONE Continuity test:
CLOSED: [2016-03-02 Wed 15:29]
***** need check testmethod

**** DONE Gross Functional Test
CLOSED: [2016-03-02 Wed 15:51]
need check testmethod

**** DONE Internal RC Oscillator Trim Tests
CLOSED: [2016-03-14 Mon 11:14]
need develop testmethod
***** DONE fcc1_irc_osc_trim_chk1
CLOSED: [2016-03-11 Fri 15:30]
***** DONE fcc1_irc_osc_trim_chk2
CLOSED: [2016-03-14 Mon 09:52]

***** DONE fcc1_irc_osc_trim_chk3
CLOSED: [2016-03-14 Mon 10:59]

**** DONE Verify Flash and ROM Boot Code Tests
CLOSED: [2016-03-14 Mon 11:32]
need develop testmethod
**** DONE Device Learn Configuration
CLOSED: [2016-03-14 Mon 14:23]

need develop testmethod

**** DONE ROM/Flash learn datalog option
CLOSED: [2016-03-14 Mon 14:40]

need develop testmethod
**** DONE PLL_Max_Freq_Test
CLOSED: [2016-03-14 Mon 14:52]

need develop testmethod
**** DONE Brownout_Test
CLOSED: [2016-03-14 Mon 15:55]
need develop testflow
need develop testmethod
**** DONE FLASH Speed Test
CLOSED: [2016-03-16 Wed 17:02]

need search freq, it users_callback() of quartet program
*functional_tests_fcc1_flash need loop 20 times, add one input parameter in testmethod* 
fuctional_tests_fcc1_startup not test, need testmethod?
need develop testmethod
***** TODO charmaxflash level timing need manual create if this item need test
***** TODO starup test need add dps ramp up at test method Functional_Test_startup


need develop testmethod
**** DONE Fuctional Tests
CLOSED: [2016-03-16 Wed 17:02]
***** TODO ports_rd_wt_wr need manually add timing/level info because allpins_nodbgen not exists
***** TODO pwm_1edge not convert and stop marker need add -3, need clone pattern
#+BEGIN_SRC c     
if (lqfp100pin == 1 || dierev1 == 0)
      {
        start = LABEL_START(pwm_1edge100); // VECTOR_START
        stop =  LABEL_STOP (pwm_1edge100); // VECTOR_STOP
      }
     else
      {
        start = LABEL_START(pwm_1edge); // VECTOR_START
        stop =  LABEL_STOP (pwm_1edge) - 3; // VECTOR_STOP
      }


#+END_SRC
need develop testmethod
**** DONE SCAN/RAM Test
CLOSED: [2016-03-17 Thu 17:04]
***** TODO timing level setup need manually set


need develop testmethod
**** DONE IDD_ Power_Down Tests
CLOSED: [2016-03-18 Fri 11:30]
need develop testmethod
**** DONE Leakage Tests
CLOSED: [2016-03-25 Fri 14:28]
***** TODO Leakage_fbpmuItest_fcc1
whether need run init_sramloader?
#+BEGIN_SRC c
    if (stop > 0)
     {
     close_fixture_relays (vdd1_8_relay, 0.0);// core1.8 not used
     open_fixture_relays (vdd3_0_relay, 0.0);
     open_fixture_relays (RLY_AVDD, 0.0);
     open_fixture_relays (vdd3vref_rly, 0.0);
     open_fixture_relays (core3_3_rly, 0.0);
     open_fixture_relays (dcdc_relay, 0.0);
     open_fixture_relays (vbat_relay, 0.0);



     for (i = 0; i < 5; i++) 
      {
      if (init_sram_loader_fcc1(1.0) == 0) { i = 5; }
      }   

     }   

#+END_SRC
***** TODO Leakage_fbpmuItest_fcc1_nopd
pattern not convert
#+BEGIN_SRC c
     if (dierev1 == 0)
      {
        start = LABEL_START(rtc_alrmfast100); // VECTOR_START
        stop =  LABEL_STOP (rtc_alrmfast100_h); // VECTOR_STOP
      }
     else
      {
        start = LABEL_START(rtc_alarm_fast); // VECTOR_START
        stop =  LABEL_STOP (rtc_alarm_fast_h); // VECTOR_STOP
      }


#+END_SRC
**** DONE Pullup Pulldown Tests
CLOSED: [2016-03-28 Mon 14:45]
need develop testmethod
startup1 and startup2 runs at 50Mhz, need modify timing
**** DONE EOS Continuity test
CLOSED: [2016-03-28 Mon 14:54]
*** DONE [#A] timing split to multiport to avoid period exceeds 50Mhz(ie. period < 20ns)
CLOSED: [2016-03-31 Thu 18:14]
:LOGBOOK:
CLOCK: [2016-03-31 Thu 13:06]--[2016-03-31 Thu 18:14] =>  5:08
:END:
**** TODO 2 issue still some mass, may be this kind of convert is not proper, maybe should
modify aic???? study period_res
1. power port can not use spec variable
2. must set period res
   add peroid_res after each EQUATION   <2016-04-05 Tue> 
*** DONE add level/timing pattern setup info
CLOSED: [2016-04-05 Tue 15:11]
done with modify ft flow
*** TODO check level/timing and create 208pin flow
:LOGBOOK:
CLOCK: [2016-04-19 Tue 16:45]--[2016-04-19 Tue 17:55] =>  1:10
CLOCK: [2016-04-12 Tue 14:05]--[2016-04-12 Tue 15:16] =>  1:11
:END:
**** TODO [#A] multiport timing test method cab not use 1_1_1, should use specification

*** DONE add fail bin info
CLOSED: [2016-04-06 Wed 13:07]
:LOGBOOK:
CLOCK: [2016-04-06 Wed 09:37]--[2016-04-06 Wed 11:05] =>  1:28
:END:

*** DONE check_test_table
CLOSED: [2016-04-11 Mon 14:33]
:LOGBOOK:
CLOCK: [2016-04-11 Mon 08:58]--[2016-04-11 Mon 14:31] =>  5:33
CLOCK: [2016-04-08 Fri 13:13]--[2016-04-08 Fri 16:26] =>  3:13
CLOCK: [2016-04-07 Thu 13:11]--[2016-04-08 Thu 18:11] =>  6:00
CLOCK: [2016-04-07 Thu 10:33]--[2016-04-07 Thu 11:32] =>  0:59
CLOCK: [2016-04-06 Wed 13:07]--[2016-04-06 Wed 16:46] =>  3:39
:END:
**** TODO Short_PMU property view min value must set to -2000, -2500mv exceeds limit
**** TODO Open_DPS need IFVM but dpstask can not force current, if use spmu_task need add dps128 digital pin
**** TODO init_sram_loader whether need stop on fail. or judge pass/fail
**** TODO fcc1_irc_osc_trim_chk1 VEC_LABEL_EDIT error
**** TODO fcc1_irc_osc_trim_vfy pattern not exist

**** TODO Char_max_flash call_back_measure need convert to test method


*** TODO complete 208pin offline
*** TODO how to control datalog output? what format is this program nee
* Quartet Conversion Tool

** tool usage
1) please type "perl quartet2v93k.pl -h" for help infomation
2) Notice that: -i -o is required and other arguments is optional.
3) *swav files must run dos2unix command before use!*
4) why parsing swav file takes a long time? is it necessary if I do not convert pattern?
   - must parsing each line of the swav file to know what timesets the pattern used
   - it is better to include all swav files  to get correct pattern line number info
     in quartet program it not just only use marker info but used absolutely line number as
     label start or stop.
5) in quartet program if sub function called but can not find its definition will ignore 
   this function, 
   *if the parameter numbers is not same, will show warning, previous is show error!*

** TODO [#B] split avc and generate split pattern. maybe next product 
** TODO [#B] level vol/vt/dps clamp current exceed limit should be auto correct and give warnings
   
** TODO [#C] Add failbin information at flo

need use keyword failbin, so it can not be a general function like tsetx

** DONE [#A] 208 pin ft flow have warnings, uninitialized timing eqn/spec/set numbers
CLOSED: [2016-04-18 Mon 09:56]
** TODO [#C] level how can keep pin group name?
** TODO [#B] add port Dig and Power at 93k pin
